{
  "basics": {
    "name": "Eduardo Arnold",
    "label": "Desenvolvedor",
    "picture": "",
    "email": "eduardo.arnold@outlook.com",
    "phone": "(051) 98039-5374",
    "location": {
      "address": "Centro",
      "city": "Porto Alegre",
      "countryCode": "RS"
    },
    "profiles": [
      {
        "network": "github",
        "username": "nyraxle",
        "url": "http://github.com/nyraxle/"
      },
      {
        "network": "npm",
        "username": "kalvasflam",
        "url": "https://npmjs.org/~kalvasflam"
      },
      {
        "network": "PDF",
        "username": "download",
        "url": "https://github.com/nyraxle/nyraxle/raw/master/resume/resume.pdf"
      }
    ]
  },
  "work": [
    {
      "company": "CWI",
      "position": "Desenvolvedor",
      "startDate": "2014-11-02",
      "highlights": [
        "Atualmente: ENEL: Desenvolvimento de uma aplicação de contratos de crédito. Tecnologias: React, dotnet core, mongodb",
        "Auxiliadora Predial: Auxiliadora Predial: Desenvolvimento de uma aplicação voltada para a gestão condominial utilizando conceitos de microserviços. Tecnologias: Angular, Typescript, dotnet core",
        "Niely - eCoop: Sistema de gestão de ações de marketing e cooperações comerciais da L’Óreal – Niely Brasil. Atuei como desenvolvedor full stack. Tecnologias: AngularJS, ASP.NET Web API, Entity Framework, Git, Grunt, SQL Server, TeamCity (CI), Specflow",
        "Fleury - CR: Reescrita de um projeto legado em VB para Web. Montei a arquitetura de front-end e atuei no desenvolvimento do front e back-end da aplicação. Tecnologias: AngularJS, Webpack, Dapper .NET, WCF, ASP.NET Web API.",
        "Credz - Portal Pessoa Juridica: Portal pessoa jurídica e sistema de gestão de crédito de pessoas jurídicas para a  bandeira Credz. Desenvolvi a arquitetura front-end da aplicação Single-page e atuei em diversas funcionalidades no back-end. Tecnologias: AngularJS, ASP.NET Web API, Entity Framework, Gulp, SQL Server",
        "Elefante Letrado: Sistema de ebooks para o publico infanto-juvenil. Participei do desenvolvimento do front e back-end do painel estatistico. Tecnologias: AngularJS, .NET, Entity Framework",
        "Finaud - RiskDriver: Sistema de gestão de risco financeiro. Atuei na segunda fase no desenvolvimento de funcionalidades como a importação de dados do Banco Central e a geração de formulários dinâmicos em Web. Tecnologias: AngularJS, ASP.NET MVC, Entity Framework, SQL Server.",
        "Credz - Fabrica: Sistemas de gerenciamento de crédito para pessoa física, SGC, Portal. Atuei em front e back-end na manutenção dos sistemas legados existentes. Tecnologias: ASP.NET MVC, Entity Framework, SQL Server, WCF, ASP.NET Web API."
      ]
    },
    {
      "company": "Datum T.I",
      "position": "Estagiário",
      "startDate": "2011-11-30",
      "endDate": "2013-06-05"
    }
  ],
  "education": [
    {
      "institution": "PUCRS",
      "area": "Sistemas de Informaçao",
      "studyType": "Bacharel",
      "startDate": "2011-03-01",
      "endDate": "2016-01-05"
    }
  ],
  "publications": [
    {
      "name": "OpenPBL: Proposta de Sistema para Auxilio ao Aprendizado Baseado em Problemas",
      "publisher": "Conferencia Internacional de Informatica Educativa 2015 - TISE 2015, 2015. v. 1. p. 1-8",
      "releaseDate": "2015",
      "website": "https://openpbl-stage.herokuapp.com",
      "summary": "Sistema desenvolvido com o objetivo de apoiar professores que desejam fazer uso do Problem-based Learning (PBL) em atividades escolares. Ferramenta desenvolvida aplicando as praticas de IHC, boas praticas de desenvolvimento e qualidade de codigo. Tecnologias: NodeJS, AngularJS, MongoDB, Grunt, Cucumber, PaaS (Heroku e Mongolab)."
    }
  ],
  "skills": [
    {
      "name": "Tecnologias",
      "keywords": [
        "Javascript",
        "Typescript",
        "ES6",
        "NodeJS",
        "Angular",
        "AngularJS",
        "React",
        "Webpack",
        "Gulp",
        "Bower",
        "Grunt",
        "HTML5",
        "CSS3",
        "ASP.NET WebAPI",
        ".NET",
        "dotnet core",
        "Dapper.NET",
        "Cucumber",
        "Specflow",
        "BDD",
        "MochaJS",
        "Jasmine",
        "MongoDB",
        "SQL",
        "Travis-CI",
        "TeamCity",
        "Heroku",
        "Git"
      ]
    }
  ],
  "languages": [
    {
      "fluency": "lê bem, compreende bem, fala razoavelmente, escreve razoavelmente",
      "language": "Ingles"
    }
  ],
  "interests": [
    {
      "name": "Development",
      "keywords": [
        "Javascript",
        "NodeJS",
        "Artificial Intelligence",
        "Unix Philosophy"
      ]
    },
    {
      "name": "Game Development",
      "keywords": [
        "Unity",
        "Construct"
      ]
    }
  ]
}
